In [2]:
import pandas as pd
import numpy as np

In [3]:
from pandas import Series

In [4]:
obj = Series([100, 200, 300, 400, 500], index=['d', 'a', 'b', 'e', 'c'])
obj

d    100
a    200
b    300
e    400
c    500
dtype: int64

In [5]:
obj = obj.reindex(['a','b','c','d','e'])
obj

a    200
b    300
c    500
d    100
e    400
dtype: int64

In [6]:
data = { 'Name':['John', 'Bob', 'Randy'],
        'Age':[34, 56, 23],
        'Shift':[5, 2, 7]
       }

In [7]:
df1 = pd.DataFrame(data)
df1

   Age   Name  Shift
0   34   John      5
1   56    Bob      2
2   23  Randy      7

In [8]:
df1 = df1.reindex([0, 2, 1])
df1

   Age   Name  Shift
0   34   John      5
2   23  Randy      7
1   56    Bob      2

In [9]:
fields = ['Name', 'Age', 'Shift']
df1 = df1.reindex(columns=fields)
df1

    Name  Age  Shift
0   John   34      5
2  Randy   23      7
1    Bob   56      2

In [11]:
df2 = df1.drop(2)
df2

   Name  Age  Shift
0  John   34      5
1   Bob   56      2

In [12]:
df2 = df1.drop('Shift', axis=1)
df2

    Name  Age
0   John   34
2  Randy   23
1    Bob   56